blog/app/controllers/pages_controller.rb

    def create
        @page = Page.new(page_params)
        @page.save
---
INSERT INTO "pages" ("title", "body", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def edit
        @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def update
        @page = Page.find(params[:id])
        # render plain: params.to_json
        # @page.update(params.require(:page)
        #     .permit(:title, :body, :slug))

        @page.update(page_params)
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "pages" SET "body" = ?, "updated_at" = ? WHERE "pages"."id" = ?

    def destroy
        @page = Page.find(params[:id])
        @page.destroy
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 11]]